DiseaseDatasetCuration/app/views/users/show.html.erb

SELECT  1 AS one FROM "submissions" WHERE "submissions"."user_id" = ? LIMIT 1  [["user_id", 1]]
---
        <li class="list-group-item text-right"><span class="pull-left"><strong>Joined</strong></span> <%= @user.created_at %></li>
        <li class="list-group-item text-right"><span class="pull-left"><strong>Submissions</strong></span> <%= (@user.submissions.any?)?@user.submissions.count():0%></li>