DiseaseDatasetCuration/app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT 1  [["email", "mashuo93@gmail.com"]]
---
  def create
    if params[:session].nil?||params[:session][:email].nil?
      user = User.from_omniauth(env["omniauth.auth"])
      if user
        session[:user_id] = user.id
        redirect_to '/profile'
        return
      end
    end


    user = User.find_by(email: params[:session][:email].downcase)